#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		Заголовок = НСтр("ru = 'Новый документ'");
	Иначе
		Заголовок = Объект.Наименование;
	КонецЕсли;

	// T-016: для изображений показать файл в поле «Просмотр» (АдресПросмотра).

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФайлОбработка(Команда)

	// T-016: открыть файл документа средствами устройства.
	ПоказатьПредупреждение(, НСтр("ru = \'Пока не работает\'"));

КонецПроцедуры

#КонецОбласти
